from django.shortcuts import render
from .forms import BungoTest, Test2_a, Test2_b, Test3a_a, Test3a_b

# Create your views here.
def base(request):
    return render(request, 'web/base.html')
    
def index(request):
    params = {
        'title':'文豪性格診断',
        'description':'当サイトは、簡単な問題に答えてもらうことで、あなたに似ている性格の文豪が分かる文豪性格診断を提供しています。',
        'bungoexample':'太宰治、芥川龍之介、夏目漱石、志賀直也、谷崎潤一郎等...',
        'link':'test',
        'link2':'list_bungo',
    }
    return render(request, 'web/index.html',params)

def list_bungo(request):
    params = {
        'dazai':'太宰治:破産型タイプ',
        'akutagawa':'芥川龍之介:繊細タイプ',
        'natume':'夏目漱石:権威タイプ',
        'ougai':'森鷗外:博学タイプ',
        'itiyou':'樋口一葉:天才タイプ',
        'siga':'志賀直也:金持ちタイプ',
        'saneatu':'武者小路実篤:愚直タイプ',
        'tanizaki':'谷崎潤一郎:変態タイプ',
        'kahuu':'永井荷風:性欲タイプ',
        'simada':'島田清次郎:刹那タイプ',
        'kikuti':'菊池寛:ビジネスタイプ',
        'kazii':'梶井基次郎:センスタイプ',
        'kouyou':'尾崎紅葉:親分タイプ',
        'bizan':'川上眉山:無冠の天才タイプ',
        'ranpo':'江戸川乱歩:放浪タイプ',
        'zenzou':'葛西善蔵:ほろ酔いタイプ',
        'description':'このページでは、診断結果で表示される文豪一覧を見ることができます。',
        'description2':'性格の詳細は、それぞれの文豪名をクリックすることによって、詳細ページに移行できます。',
    }
    return render(request, 'web/list_bungo.html', params)

def test(request):
    params = {
        'title':'診断ページ1/3',
        'ques1':'問題1:お酒を飲む頻度とそのスタイルを教えてください',
        'ques2':'問題2:どの思想に共感しますか？',
        'ques3':'問題3:世間で言われるところの「常識」についてどう思いますか？',
        'ques4':'問題4:今まで「「私」とは何か？」と、自問したことはどれぐらいありましたか？',
        'ques5':'問題5:好きな本のタイプを教えてください。',
        'placeholderdes':'次の選択肢の中から一つ選んでください。',
        'message':'message',
        'forms':BungoTest(),
        'link':'test2',
    }
    if request.method=='POST':
        params['message']=request.post['ques1']
        params['forms'] =BungoTest(request.POST)
    return render(request, 'web/test.html', params)


def test2(request):
    params = {
        'ques1':request.POST['ques1'],
        'ques2':request.POST['ques2'],
        'ques3':request.POST['ques3'],
        'ques4':request.POST['ques4'],
        'ques5':request.POST['ques5'],
        'ques_val':int(request.POST['ques1']) + int(request.POST['ques2']) + int(request.POST['ques3']) + int(request.POST['ques4']) + int(request.POST['ques5'])
    }
    if params['ques_val']<25:
        params = {
            'title':'診断ページ2/3(一般人）',
            'ques1':'問題1:どのようにして仕事を進めることが多いですか？',
            'ques2':'問題2:理想的な仕事のペースはどの程度ですか？',
            'ques3':'問題3:同僚に自分の考えや思いを伝えなければならないとき、どうしますか？',
            'ques4':'問題4:年老いたら何がしたいですか？',
            'ques5':'問題5:あなたは書店で「悲愴で平和な僕の日常」という本を見つけました。どう思いますか？',
            'placeholderdes':'次の選択肢の中から一つ選んでください。',
            'message':'message',
            'forms':Test2_a(),
            'link':'test3a',
        }
        return render(request, 'web/test2_lead_or_seiyoku.html',params)
    
    params = {
        'title':'診断ページ2/3（文豪）',
        'ques1':'問題1:自分は変わり者だと思いますか？',
        'ques2':'問題2:あなたが最も嫌いなものを教えてください。',
        'ques3':'問題3:あなたが興味があることをおしえてください。',
        'ques4':'問題4:煩悶、憂愁、懊悩。これらの言葉についてどう思いますか？',
        'ques5':'問題5:あなたを助けるものはなんですか？',
        'placeholderdes':'次の選択肢の中から一つ選んでください。',
        'message':'message',
        'forms':Test2_b(),
        'link':'test3b',
    }
    return render(request, 'web/test2_sensai_or_lead.html',params)

def test3a(request):
    params = {
        'ques1':request.POST['ques1'],
        'ques2':request.POST['ques2'],
        'ques3':request.POST['ques3'],
        'ques4':request.POST['ques4'],
        'ques5':request.POST['ques5'],
        'ques_val':int(request.POST['ques1']) + int(request.POST['ques2']) + int(request.POST['ques3']) + int(request.POST['ques4']) + int(request.POST['ques5'])
    }
    if params['ques_val']==0:
        params = {
            'title':'月並みパターン',
            'ques1':'問題1:勉強はどの程度得意ですか？',
            'ques2':'問題2:どのように仕事を進めますか？',
            'ques3':'問題3:喧嘩は強いですか？',
            'ques4':'問題4:部下はたくさんほしいですか？',
            'ques5':'問題5:正直なタイプですか？',
            'placeholderdes':'次の選択肢の中から一つ選んでください。',
            'message':'message',
            'forms':Test3a_a(),
            'link':'test3a',
        }
        return render(request, 'web/test3a_a.html',params)

    params = {
        'title':'性欲高めタイプ',
        'ques1':'問題1:今までどれぐらいの人と恋愛してきましたか？',
        'ques2':'問題2:「ありきたりな恋愛」とは、人間の男女が恋愛関係に陥ることをいいます。この「ありきたりな恋愛」についてどう思いますか？',
        'ques3':'問題3:運動と勉強が苦手な友達がいます。この友達に対してどう思いますか？',
        'ques4':'問題4:空想や思索に、どれぐらいふけることが多いですか？',
        'ques5':'問題5:友人の余命をあなただけが知っています。友人はあなたに、「余命はどれぐらい？」尋ねました。どうしますか？',
        'placeholderdes':'次の選択肢の中から一つ選んでください。',
        'message':'message',
        'forms':Test3a_b(),
        'link':'result_3ab',
    }
    return render(request, 'web/test3a_b.html',params)

def result_3ab(request):
    params = {
        'ques1':request.POST['ques1'],
        'ques2':request.POST['ques2'],
        'ques3':request.POST['ques3'],
        'ques4':request.POST['ques4'],
        'ques5':request.POST['ques5'],
        'ques_val':int(request.POST['ques1']) + int(request.POST['ques2']) + int(request.POST['ques3']) + int(request.POST['ques4']) + int(request.POST['ques5'])
    }
    if params['ques1']=='10':
        return kahuu(request)

    if params['ques2']=='5':
        return ranpo(request)
    
    if params['ques3']=='10':
        return tanizaki(request)

    if params['ques4']=='10':
        return ranpo(request)

    if params['ques5']=='10':
        return saneatu(request)

    return akutagawa(request)

def dazai(request):
    params = {
        'description':'太宰治タイプは、他人にはない独特の感性と、気に入ったものをとことん追求する強い探究心をお持ちの方です。',
        'citedes':'この世では、きっと、あなたが正しくて、私こそ間違っているのだろうとも思いますが、私には、どこが、どんなに間違っているのか、どうしても、わかりません。',
        'citeauth':'太宰治「きりぎりす」',
        'feature':'太宰治タイプの特徴',
        'whatauth':'太宰治はどんな人？',
        'pdes':'　このタイプの人は、良くも悪くも周囲の人々とは違う独特の感性であったり、考え方をする場合が多いです。そのため、創造的な仕事であったり、芸術分野においては、強みを発揮できるでしょう。また、一つのことに没頭する探究心も素晴らしいため、未だ成し遂げていない偉業を残す可能性を秘めた人々とも言えるでしょう。',
        'pdes2':'　一方で、その独特の感性が周囲の人々と衝突し、周囲の無理解に苦しむこともあるかもしれません。その際、破滅的な道を自ら選んだり、快楽に進むことによって、寂しさを埋めようとしてしまうことがあります。',
        'pdes3':'　そのため、このタイプの人は、自身の独特の感性で、成功を収めるか、世の中に受け入れられず、堕落するかといった究極の二択に悩むこととなるでしょう。',
        'pdes4':'　平穏無事に過ごしたいのであれば、あまり快楽に溺れすぎず、周囲の人々の意見を優先すれば、良いでしょうが、おそらくこのタイプの人々はそういう「普通」の生き方自体を嫌っていることもあるでしょう。',
        'pdes5':'　総じて、太宰治タイプは、例えるなら嵐のような人と言えるでしょう。',
        'authdes':'　太宰治は、「人間失格」、「斜陽」、「走れメロス」、「パンドラの匣」などで知られる、主に昭和時代に活躍した作家です。作風の特徴は、初期と後期が破滅的である一方、中期は比較的穏当であり、しばしば日本昔ばなしやハムレットのような、先人の作品を自分なりに解釈して新しく構成するような作品も目立ちます。「新ハムレット」や「お伽草子」に代表されるこの作風は、尊敬していた先輩芥川龍之介の影響もあることでしょう。太宰治の人間性については、矛盾する二面を持つ人と形容でき、例えば、喧嘩をよくする割に、気が弱かったり、酒を浴びるように飲むくせに酒が嫌いと言ったり、良く言えば、文学的、悪く言えば、面倒くさい人です。',
        'authdes2':'　世間一般では、女と心中したクソ野郎というイメージが定着していますが、変人が当たり前の文豪の世界では、そこまで注目すべき点でもないと私は思います。太宰治の特徴は、一見破滅的でのらりくらりしているようですが、実は非常に勤勉であり、戦争の最中においても、作品を執筆し続けた不屈の作家魂がある人です。悪目立ちしていますが、作品も、人間生活の矛盾ややるせない怒りを実に非常に見事に表現しており、やはりその文学的センスに刮目せざるをえません。',
        'authdes3':'　現代では躁鬱病と言われてもおかしくないように、彼の作品は、明るいものから暗いものから非常にバリエーションに富んでいます。また、月次みな表現でいうと、彼は子供っぽいところも多く、例えば志賀直也と派手な口論をしたり、川端康成に「刺す」という文章を送ったり、何かと話題が尽きません。',
        'authdes4':'　そのため、一概に「太宰治はこういう人！」と表現するのは難しいですが、勤勉さとセンスのみを追求しすぎて、常識を失った人と言えるかもしれません。'
    }
    return render(request, 'web/dazai.html',params)

def natume(request):
    params = {
        'description':'夏目漱石タイプは、伝統を重んじ、その博学と勤勉さで、周囲の模範たりうる人徳をお持ちの方です。',
        'citedes':'茫々たる薄墨色の世界を、幾条の銀箭が斜めに走るなかを、ひたぶるに濡れて行くわれを、われならぬ人の姿と思えば、詩にもなる、句にも咏まれる。有体なる己を忘れ尽くして純客観に眼をつくる時、始めてわれは画中の人物として、自然の景物と美しき調和を保つ。',
        'citeauth':'夏目漱石「草枕」',
        'feature':'夏目漱石タイプの特徴',
        'whatauth':'夏目漱石はどんな人？',
        'pdes':'　このタイプの人は、非常に努力家であると同時に、天才肌であるため、周囲の信頼が厚い人であることが多いです。そのため、リーダーであったり、組織を導く立場に向いています。',
        'pdes2':'　一方で、努力を欠かさず、常に最善を探るストイックな性質から、自分が正しいと思い込むことも多く、周囲の意見をあまり聞かなかったり、見当違いな偏見を抱いてしまう場合もあります。',
        'pdes3':'　そのため、このタイプの人は、好かれる人からはとことん好かれるが、嫌われる人からはとことん嫌われる可能性を秘めていると言えるでしょう。',
        'pdes4':'　このタイプの人は、素質が豊富で、そもそもできない人の気持ちを理解していない可能性がありますが、相手の立場になって考えて行動することをより一層心がけると、まさに非の打ち所のない人になれるでしょう。',
        'pdes5':'　総じて夏目漱石タイプは、自分が優秀すぎるが故に独善的になる危険がある人です。',
        'authdes':'　夏目漱石は、「こころ」、「行人」、「草枕」、「吾輩は猫である」などで知られる、明治から大正時代にかけて活躍した作家です。作風の特徴は、内省的で、哲学的なものが多く、日本におけるドストエフスキーと言っても過言ではないほど、日本近代文学で一、二を争う、文豪です。',
        'authdes2':'　夏目漱石と言えば、ロンドン留学で、神経衰弱に悩まされたというエピソードが有名な通り、彼は近代化の闇を同時代でいち早く見抜いた知識人としても知られています。',
        'authdes3':'　また文豪にしては珍しく、女嫌いの傾向が見られ、情欲に溺れるタイプの人ではなく、まさにストイックと評するにふさわしい人でしょう。',
        'authdes4':'　夏目漱石がなぜここまで偉大な作家としてもてはやされているのかというと、やはりその人間洞察の深さとそれを作品に落とし込む圧倒的文章力に敬服する人が多いからでしょう。同時代では、芥川龍之介も彼の門下生として知られており、夏目漱石は、後の有名作家の模範たりうる姿を見せていました。しかし、彼の作家デビューは非常に遅く、30代後半でした。それでも、他の若手作家や大家を押しのけて、文壇のトップに君臨したことから、凄まじい資質を感じさせます。',
    }
    return render(request, 'web/natume.html',params)

def akutagawa(request):
    params = {
        'description':'芥川龍之介タイプは、繊細すぎる神経と鋭利すぎる感性で、新しい解釈を提示する人です。',
        'citedes':'それは僕の一生の中でも最も恐しい経験だつた。――僕はもうこの先を書きつづける力を持つてゐない。かう云ふ気もちの中に生きてゐるのは何とも言はれない苦痛である。誰か僕の眠つてゐるうちにそつと絞め殺してくれるものはないか？',
        'citeauth':'芥川龍之介「歯車」',
        'feature':'芥川龍之介タイプの特徴',
        'whatauth':'芥川龍之介はどんな人？',
        'pdes':'　このタイプの人は、感覚や着眼点が鋭いため、議論で相手の矛盾をいち早く見破ったり、誰も気づかなかった解釈をしたりして、周囲を驚かせることでしょう。そのため、頭の回転の速さが求められる仕事や、既存のものを改良して、新しい作品や解釈を提示するような仕事に向いています。',
        'pdes2':'　一方で、繊細すぎる神経故に、憂鬱になりやすく、孤独耐性が充分ではないため、良き理解者であったり、パートナーのような存在が不可欠です。しかし、このタイプの人々は、周囲から羨まれ、時には敵意を向けられることもあるため、必ずしもそのような理解者を得ることは簡単ではありません。',
        'pdes3':'　そのため、このタイプの人は、孤独を強がらず、積極的に弱みを相手に見せることで、距離を縮められるかもしれません。',
        'pdes4':'　このタイプの人は、本質的には人付き合いが苦手なタイプではないため、良き理解者であったり、親友に対しては心を開くタイプでもあります。ただ、繊細な神経や鋭敏な頭脳で、相手の考えや仕草から、必要以上に思慮し、勝手に疲れてしまうことが多いため、人付き合いに積極的になれなかったりするのです。',
        'pdes5':'　総じて、芥川龍之介タイプは、繊細な神経が良くも悪くも作用している人と言えるでしょう。',
        'authdes':'　芥川龍之介は、「羅生門」、「地獄変」、「河童」、「侏儒の言葉」などで知られる、主に大正時代に活躍した作家です。作風の特徴は、古典の新解釈の体をなすものが多く、いわゆる換骨奪胎による作品が特徴です。この作風は、のちの太宰治にも影響を与えました。また、彼の作品のほとんど全てが短編であり、長編と呼べるような作品は、一つもありません。そのため、文豪としては珍しく作風のバリエーションはやや狭いと言えるかもしれません。芥川龍之介の人間性については、繊細な神経を持ち、勉学に秀でていたため、現代で言う陰キャのようかと思いきや、友達は多く、どちらかというと社交的なタイプのようにも受け取れます。また、かなりのヘビースモーカーとしても知られています。',
        'authdes2':'　世間一般では、沈鬱または悲壮といったイメージが定着していますが、親友菊池寛をはじめとして、多くの友人に恵まれていたため、彼の日記などは、意外にも朗らかな文章が書かれており、悲愴さはそこまで感じさせません。芥川龍之介の特徴は、皮肉を利かせた、鋭い人間観察であり、思わず「はっ」とさせられる作品が多いです。また、アフォリズムも手がけており、フランスのラ・ロシュフコーを彷彿とさせます。',
        'authdes3':'　芥川龍之介は、太宰治のように、自ら進んで相手と衝突しに行くというよりは、一歩引いて達観するという位置にいることが多く、それが彼の皮肉たっぷりの作品をより一層魅力的にしているのかもしれません。',
        'authdes4':'　総じて、芥川龍之介は、繊細な神経を持ちながら、多くの友人を持った、一流の皮肉屋と言えるでしょう。',
    }
    return render(request, 'web/akutagawa.html',params)


def ougai(request):
    params = {
        'description':'森鷗外タイプは、圧倒的知識量と博学さで、その道の権威たりうる素質を持つ方です。',
        'citedes':'その今日でなくなった今日には閲歴がある。それが人生の閲歴、生活の閲歴でなくてはならない筈である。それを書こうと思って久しく徒に過ぎ去る記念に、空虚な数字のみを留めた日記の、新しいペエジを開いたのである。',
        'citeauth':'森鷗外「青年」',
        'feature':'森鷗外タイプの特徴',
        'whatauth':'森鷗外はどんな人？',
        'pdes':'　このタイプの人は、勉強が好きなことが多く、勉学において圧倒的な成績を修めている人が多いです。知的好奇心も強く、文系理系関係なく、あらゆる分野の知識を豊富に持っていることでしょう。そのため、大学教授から、医者、弁護士等、その道を究めた専門家が向いているでしょう。',
        'pdes2':'　一方で、知的好奇心が災いして、妙なこだわりを持っていたり、頻繁に論争を起こしたりと、頭が良すぎる故に、周囲から変わりものと評されることも少なくないかもしれません。',
        'pdes3':'　そのため、このタイプの人は、周りを見下さずに、協調の精神を持って、進んで相手の意見を取り入れるなどすると、非常にバランス感覚のよい稀有な人になることができるでしょう。',
        'pdes4':'　このタイプの人は、バイタリティーにあふれることも多く、粘り強いため、経営者やスポーツ選手にも向いているかもしれません。',
        'pdes5':'　総じて、森鷗外タイプは、圧倒的博学によって、自信に満ちていますが、高慢さが生じてしまう点が惜しい人です。',
        'authdes':'　森鷗外は、「舞姫」、「青年」、「阿部一族」、「山椒大夫」などで知られる、主に明治から大正時代に活躍した作家です。作風の特徴は、歴史小説から、芥川龍之介のような換骨奪胎スタイル、恋愛小説まで、非常に幅広いです。また、漢文や詩歌にも秀で、陸軍軍医としての顔も合わせもつことから、まさに多才と評するにふさわしく、文系理系の垣根を感じさせない人です。',
        'authdes2':'　森鷗外といえば、「舞姫」が有名ですが、この話は実話をもとにしていると言われており、実際に森鷗外はドイツ留学で出会った女性を捨てたクソ男としての評判も確立しています。まあ、文豪の中では、まだまだかわいい方だと、私は思いますけどね、、、。',
        'authdes3':'　森鷗外の特徴は、やはりその圧倒的博学にあり、医者としてはもちろん、ドイツ語、フランス語、漢文、文学、詩歌と、あらゆるものに精通しており、歴史的に見ても、その博学度は、トップクラスと言えるかもしれません。',
        'authdes4':'　言うまでもなく、彼は頭が良かったため、一部の作品では、必ずしも読者目線で書かれていないものもあり、特に一部の歴史小説は、彼の博学度合いが分かるものでしかないような作品もあります(個人の感想です)。そのため、森鷗外は、他の文豪に比べて、良くも悪くもキャッチーな作品が少ない作家と言えます。',
    }
    return render(request, 'web/ougai.html',params)


def itiyou(request):
    params = {
        'description':'樋口一葉タイプは、幼少期から才能に恵まれ、早熟で野心にあふれる人です。',
        'citedes':'雪子が繰かへす言の葉は昨日も今日も昨一日をとゝひも、三月の以前も其前も、更に異なる事をば言はざりき、唇に絶えぬは植村といふ名、ゆるし給へと言ふ言葉、學校といひ、手紙といひ、我罪、おあとから行まする、戀しき君、さる詞をば次第なく並べて、身は此處に心はもぬけのからに成りたれば、人の言へるは聞分るよしも無く、樂しげに笑ふは無心の昔しを夢みてなるべく、胸を抱きて苦悶するは遣るかた無かりし當時のさまの再び現にあらはるゝなるべし。',
        'citeauth':'樋口一葉「うつせみ」',
        'feature':'樋口一葉タイプの特徴',
        'whatauth':'樋口一葉はどんな人？',
        'pdes':'　このタイプの人は、何らかの分野において圧倒的な才能に恵まれていることが多く、誰にも真似できない唯一のスタイルを持っている場合が多いです。',
        'pdes2':'　一方で、経済的には恵まれなかったり、友人には恵まれなかったりと、才能以外の点で、何らかの不足を味わっているため、野心が強く、上に立ちたいという思いは人一倍強いと言えるでしょう。',
        'pdes3':'　そのため、しばしば生意気と言われたり、低レベルのいじめの標的にされがちですが、このタイプの人は、反骨心が強く、簡単には屈しないため、そういった相手にも果敢に立ち向かっていくでしょう。',
        'pdes4':'　才能があるのは確かですが、時期によってその才能が世の中に受け入れられず、または時代がこのタイプの人の才能を理解することができず、不遇を味わうこともあるかもしれません。',
        'pdes5':'　平穏な人生を送りたいのであれば、あえて才能を生かさない道に進むというのもありかもしれません。樋口一葉タイプの人は、その才能ゆえ、波乱万丈の人生を送ることが多いでしょう。',
        'authdes':'　樋口一葉は、「たけくらべ」、「にごりえ」、「闇桜」、「十三夜」などで知られる、明治時代に活躍した作家です。作風の特徴は、女の悲しみを描いたものが多く、ほぼすべての作品のテーマが恋愛でありながら、そのほとんどが悲恋であり、悲愴なものが多いです。',
        'authdes2':'　樋口一葉といえば、結核で夭折したことで知られており、わずか、二四才でこの世を去りました。その一生は、苦労の一生でもあり、貧困の中、作品を執筆し、死ぬ直前、次々と佳作を発表したことから、天才作家と評されるようになりました。',
        'authdes3':'　文豪のほとんどが男性である中、女性の文豪は大変貴重であると同時に、その作風は女性ならではの視点と、女性にしか描けない女の姿を克明に描写しているため、その文学的価値は高く、文才の点で、一、二を争う作家と言えるかもしれません。',
        'authdes4':'　彼女は、師匠でもある半井桃水と恋愛関係にあったのではないか？と長らく研究されていましたが、真偽はいまだによくわかりません。しかし、一葉が桃水に恋愛感情を抱いていたことは確かで、作品にも恋する女性の姿が描かれています。',
    }
    return render(request, 'web/itiyou.html',params)


def siga(request):
    params = {
        'description':'志賀直也タイプは、簡潔に物事を伝え、無駄を嫌うガキ大将のような方です。',
        'citedes':'どうせ、ほこりの中にいるなら、知らずに平気でいる人の方が、幾ら幸福か知れないと思いました。',
        'citeauth':'志賀直也「濁った頭」',
        'feature':'志賀直也タイプの特徴',
        'whatauth':'志賀直也はどんな人？',
        'pdes':'　このタイプの人は、無駄を嫌い、何事も簡潔に済ませることを好みます。そのため、簡潔さが求められるビジネスパーソンや、文章を生業とする仕事が向いているでしょう。',
        'pdes2':'　一方で、幼少期は比較的恵まれた環境で育っていることも多いため、世間知らずな場合もあるため、周囲の価値観とずれていることもあるでしょう。しかし、人付き合いは苦手な方ではなく、このタイプの人は、親友を持っていることでしょう。',
        'pdes3':'　性格的には、良くも悪くも、はっきり主張するため、敵を作りやすい反面、共感者からは、強く支持されるリーダーとしての素質もあります。その点、経営者にも向いているでしょう。',
        'pdes4':'　人生観として、あまり突飛なものは好まないことから、比較的平穏に生涯を終えるでしょう。ただ、周囲の期待や重圧も少なからずあるため、それに応えなければならないプレッシャーは少なからず感じているかも知れません。',
        'pdes5':'　総じて、志賀直也タイプは、他のタイプに比べ、穏当な人生を送ることが予想されますが、穏当ならではの期待などに苦しむ可能性がある人です。',
        'authdes':'　志賀直也は、「暗夜行路」、「城の崎にて」、「児を盗む話」、「和解」などで知られる、明治後期、大正、昭和時代に活躍した作家です。作風の特徴は、所謂「私小説」が多く、金持ちの息子としての生活の悩みや、人間関係を描写した作品が多いです。',
        'authdes2':'　志賀直也といえば、ぼんぼんで知られており、苦労人の樋口一葉とは、対照的と言えるでしょう。その生涯も、長寿を全うし、悲愴な一生を送る文豪が多い中では、平和な人生を送った部類に入ると思います。',
        'authdes3':'　そのため、志賀直也は現代人の共感を呼びにくく、いまいち人気が微妙な作家ですが、志賀流とも称される、彼の簡潔で無駄のない文体は、文壇でも高く評価され、同時代(大正時代)で、トップクラスの評価を得ていました。',
        'authdes4':'　白樺派代表作家として知られる志賀直也は、どちらかというと、どこかのんびりとした作品が目立ちますが、中には、「濁った頭」のように暗鬱なトーンに満ちている作品もあるため、作品のバリエーションとしては、幅広いとも言えるかも知れません。',
    }
    return render(request, 'web/siga.html',params)



def saneatu(request):
    params = {
        'description':'武者小路実篤タイプは、実直さで、物事に正面からぶつかっていく、まっすぐな人です。',
        'citedes':'自分は女に飢えている。誠に自分は女に飢えている。残念ながら美しい女、若い女に飢えている。',
        'citeauth':'武者小路実篤「お目出たき人」',
        'feature':'武者小路実篤タイプの特徴',
        'whatauth':'武者小路実篤はどんな人？',
        'pdes':'　このタイプの人は、小細工を弄することをせず、物事に真正面から取り組んでいく、正直な方です。そのため、率直な意見が強く求められる仕事などにおいては、強みを発揮するでしょう。',
        'pdes2':'　一方で、何事にも正直すぎるため、空気が読めない人と蔑まれたりして辛い思いをすることもあるかもしれません。しかし、正直さは、このタイプの人が持つ、最大の強みですので、ぜひとも大切にしてほしいところです。',
        'pdes3':'　けれども、そもそもこのタイプの人は、メンタルが強く、些細なことでは動じないため、周囲の評判などは気にしないかもしれません。そのため、スポーツ選手のようなものにも、向いているかもしれません。',
        'pdes4':'　人生観としても、シンプルなものを好み、ひねくれた思想や、複雑で答えのない思想などには興味を抱かないことが多いです。そのため、他のタイプに比べ、幸福度が高く、余計な憂鬱を抱えることも少ないため、人生を思う存分謳歌することができる人でしょう。',
        'pdes5':'　総じて、武者小路実篤タイプは、何事も正面からぶつかり、シンプルさと実直さで、人生を豊かにしていく人と言えるでしょう。',
        'authdes':'　武者小路実篤は、「友情」、「お目出たき人」、「人間万歳」などで知られる、大正、昭和時代に活躍した作家です。作風の特徴は、人間賛美といった前向きなものが多く、ネガティブな作品が多い文豪の中では珍しい作風といえるでしょう。',
        'authdes2':'　武者小路実篤の作品は、表現が非常にシンプルかつ明快なため、文学初心者でも読みやすいことで知られています。また、テーマも、ひねくれているものはほとんどないため、暗いものが嫌いという方にもおすすめできる作家です。',
        'authdes3':'　また、熱心なトルストイファンだったことも知られており、人生で大切なことはトルストイで学んだと言うように、人柄的にも、素直な人物像が読み取れます。',
        'authdes4':'　文学だけでなく、絵画でもいくつか作品を残しており、私も調布の記念館で拝見しましたが、文学と同じく、素朴で実直な人柄を感じさせる絵画だったことを覚えています。わけわかんないことばかり言っている文豪が多い中で、武者小路実篤は、だれよりもわかりやすい表現をした文豪ともいえるかもしれません。',
    }
    return render(request, 'web/saneatu.html',params)

def tanizaki(request):
    params = {
        'description':'谷崎潤一郎タイプは、尖った嗜好を持ち、常識よりも自らの嗜好をどこまでも探求する人です。',
        'citedes':'次第に光子は増長して三人を奴隷の如く追い使い、湯上りの爪を切らせたり、鼻の穴の掃除を命じたり、Urine を飲ませたり、始終私達を側へ侍らせて、長く此の国の女王となった。',
        'citeauth':'谷崎潤一郎「少年」',
        'feature':'谷崎潤一郎タイプの特徴',
        'whatauth':'谷崎潤一郎はどんな人？',
        'pdes':'　このタイプの人は、多才で、比較的なんでもできてしまうことが多いのですが、周囲とは異なる強烈な嗜好を持っていることが多く、それの追求のために、その才能を使うような人です。そのため、常識がないと言われたり、気持ち悪いと言われることもあるかもしれません。',
        'pdes2':'　良くも悪くも、探究心は非常に高く、素質としては、あらゆることをこなすことができるにもかかわらず、自分の興味関心や、嗜好を徹底的に狭く深く研究するタイプです。',
        'pdes3':'　社会通念や、世間的常識よりも、自らの研究や信念を貫くことが多いため、型破りと評されることも多いでしょう。そのため、保守的な人や、伝統を重んじるようなタイプの人との相性はよくありません。',
        'pdes4':'　向いている職業としては、研究者や、画家、作家というように、自らの探究心を表現する機会が与えられているものが挙げられます。',
        'pdes5':'　一方で、このタイプの人は、性格的にも、どちらかというと気が強い方なので、会社員のような組織に貢献することが求められるような職業はあまり向いていない場合が多いです。',
        'authdes':'　谷崎潤一郎は、「痴人の愛」、「細雪」、「春琴抄」、「鍵」などで知られる、主に大正、昭和時代に活躍した作家です。作風の特徴は、マゾヒズム、エロティシズムといった、耽美的なものが大半を占め、足フェチのような特異な性的嗜好を全面に出された作品も存在します。',
        'authdes2':'　谷崎潤一郎は、強い女というテーマで、作品を執筆しており、例えば「痴人の愛」、「少年」などでは、女が男を支配する構図を巧みに表現しています。この思想は当時としては、非常に先進的であり、必ずしも誰しもに受け入れられたわけではありませんでしたが、文壇に多大な影響を与えました。',
        'authdes3':'　一方で、「途上」のような探偵小説、「異端者の悲しみ」のような「私小説」チックなもの等、作品のバリエーションは、文豪の中でもトップクラスで、短編から長編まで執筆していました。谷崎潤一郎というと、エロいとか、変態というイメージが先行しがちですが、その文学的才能は目を瞠るものがあり、超一流の文豪であると言えるでしょう。',
        'authdes4':'　文章表現も、美しいものも多く、漢語や古文の造形も深く、そうした語彙を自在に使いこなしていたことからも、国文学の中でも、国文学らしいものと言えるでしょう。また、有名な事件として、自分の妻を友人に譲渡し、後に返せともめたことがあり、非常に話題になりました。',
    }
    return render(request, 'web/tanizaki.html',params)

def kahuu(request):
    params = {
        'description':'永井荷風タイプは、自由奔放で、束縛を嫌う、何者にも縛られない雲のような方です。',
        'citedes':'これを読む人は、わたくしが溝の臭気と、蚊の声との中に生活する女達を深く恐れもせず、醜いともせず、むしろ見ぬ前から親しみを覚えていた事だけは推察せられるであろう。',
        'citeauth':'永井荷風「濹東綺譚」',
        'feature':'永井荷風タイプの特徴',
        'whatauth':'永井荷風はどんな人？',
        'pdes':'　このタイプの人は、束縛を嫌い、人生を自由に送りたいと考えていることが多いです。そのため、組織に縛られるような働き方や、ルーティンをきっちりこなすことが求められるような職業は向いていません。',
        'pdes2':'　一方で、思想や感覚は、鋭敏なことが多く、独創的な発想や視点を掲示する資質は充分にあります。そのため、何気ない日常からも、他の人が気づきもしない点に気づいたり、新しい見方をたやすく指摘したりします。',
        'pdes3':'　仮に組織で働いたとしても、このタイプの人は、地頭が良く、能力が優れていることが多いため、うまくやっていけるでしょうが、このタイプの人は、自身の資質を活かすことよりも、自由に生きたいという思いのほうが強い場合が多いので、才能を空費してしまうこともあるかもしれません。',
        'pdes4':'　特に、異性交友を好み、同性とつるむよりも、異性とつながっていたいと考える人が多いでしょう。また、冗談やシャレなどもうまいため、異性を楽しませるのも上手なことが多いです。',
        'pdes5':'　そのため、同性からの評価は微妙で、友達は多くありません。そして、意外にも寂しやがりやな人が多いタイプでもあります。',
        'authdes':'　永井荷風は、「濹東綺譚」、「フランス物語」、「断腸亭日乗」などで知られる、明治、大正、昭和時代に活躍した作家です。作風の特徴は、遊郭通いや、遊女との交流などが多く、性的な表現によって、発禁処分になった作品もあります。',
        'authdes2':'　永井荷風は、所謂遊び人気質の人で、遊郭通いに勤しみ、結婚を幾度かするも、最終的に独身を貫いたように、典型的な結婚に向いていない人でした。しかし、彼はただの女好きではなく、遊女との交流から、女性の仕草などの美しさや、艶めかしさを感じ、それを文学として昇華させました。',
        'authdes3':'　また、江戸戯作文学の造形も深かったことから、文章も面白いものが多く、当時における通人のような人とも言えるかもしれません。',
        'authdes4':'　好き勝手に生き、さぞ人生を謳歌したことだろうと思いきや、彼の最期は孤独死でした。',
    }
    return render(request, 'web/kahuu.html',params)

def simada(request):
    params = {
        'description':'島田清次郎タイプは、全てのタイプの中で、最も出現しにくい性格パターンであり、このタイプの人は、圧倒的な天才か、圧倒的な狂人か、もしくはその両方なのだろう。',
        'citedes':'ああ、この感情、この真理、これは自分一人ではあるまい。自分のこの涙は万人の涙であろう。自分は自分一人の寂しさに泣いていてはならない。ああ、自分はどうなっても構わない。願わくば、今ひしひしと身に迫り感じる万人の涙のために戦おう！ああ、自分には万人の悲しい涙にぬれた顔を新しい歓喜をもって輝かすことは出来ないのだろうか。自分の生はそれのみのための生涯であり、自分の使命はそれよりほかにはない！ああ、この大いなる願いが、自分の一命を必要とするならば、自分は死ぬべき時に死にもしよう！',
        'citeauth':'島田清次郎「地上」',
        'feature':'島田清次郎タイプの特徴',
        'whatauth':'島田清次郎はどんな人？',
        'pdes':'　正直なところ、このタイプの人を、一概に表現することは難しく、それぞれ際立った特徴を持っていることが多いでしょう。しかし、その中でもあえて共通点をあげるとすると、それは、みな何処かおかしいというところだろう。',
        'pdes2':'　ここでいう、「おかしい」というのは、最大の褒め言葉であると同時に、一抹の危うさを含んでいる。なぜなら、このタイプの人は、一時期、人生の絶頂を味わうが、その後に果てしないどん底を味わう可能性も秘めているからである。',
        'pdes3':'　全てのタイプの中で、最も「月並み」から遠いところに位置し、文学的センス、感性、繊細さ等は、狂人と評するまでに鋭く、研ぎ澄まされており、一般人には理解できないことも多い。',
        'pdes4':'　おそらくこのタイプの人は、自分がどういう人間であり、どこが周囲と違うのか痛いほど理解しており、それを踏まえて、絶望を味わい、やりきれない思いを芸術で注ごうとしているのかもしれない。',
        'pdes5':'　このタイプの人が幸せになるには、その天才的なまでの、狂人的繊細さを図太くするために、月並みな人をそばにおくことであろう。',
        'authdes':'　島田清次郎は、「地上」で一部の人に知られる日本の作家です。知名度は低く、おそらく文学研究者などでないと知らない作家でしょう。',
        'authdes2':'　しかし、同時代では、「地上」がベストセラーとなり、一躍時の人となりました。しかし、その人気は短く、度重なるスキャンダル、彼の傲慢な性格が災いして、その地位は急速に失墜しました。かねてより病的な傾向も散見され、晩年は精神病院で過ごすことになりました。',
        'authdes3':'　芥川龍之介の「河童」の主人公は精神病院患者でしたが、それを彷彿とさせるが如く、島田清次郎は天才であると同時に、狂人としか言いようがない言動も多く、文豪の中でも一、二を争うやばい人と表現することもできます。',
        'authdes4':'　しかし、わずか30才前後でこの世を去った短命な天才の生涯は、悲愴そのものであり、彼の人生に対するやり場のない悲しみが伺われます。',
    }
    return render(request, 'web/simada.html',params)

def kikuti(request):
    params = {
        'description':'菊池寛タイプは、経営の手腕に長けており、エンターテイメントを追求し、ユーザー目線でビジネスを進めることができる人です。',
        'citedes':'妾は女性としての恋を捨て、優しさを捨て慎しやかさを捨てゝ、たゞ復讐と膺懲のために、狂奔する化物のやうな人間にならうとしてゐるのです。顧みると、自分ながら、浅ましく思はずにはゐられません。が、悪魔を倒すのには、悪魔のやうな心と謀計とが必要です。',
        'citeauth':'菊池寛「真珠夫人」',
        'feature':'菊池寛タイプの特徴',
        'whatauth':'菊池寛はどんな人？',
        'pdes':'　このタイプの人は、経営者の素質が素晴らしく、エンターテイメント性と、ユーザー視点を自然に取り入れることができるため、会社を大企業にしていくことができるでしょう。また友人も多く、人情に厚いタイプのため、周囲の信頼を得やすいことでしょう。',
        'pdes2':'　一方、このタイプの人は、他のタイプに比べ、繊細さや感覚的な鋭さの点で、一般的なレベルのため、自ら作品を作るというより、その人望から向いている仲間に作成してもらうよう、指示を出す立場が向いているでしょう。',
        'pdes3':'　チームプレーを得意としており、組織を円滑に活動させ、部下の能力を最大限発揮させるような理想の上司になれる逸材です。また、視野も広く、様々なことに対する理解もある方でしょう。',
        'pdes4':'　このタイプの人は、基本的に誰とでもうまくやっていける社交性を備えていますが、努力で功績を成し遂げている人も多いため、才能のみで功績を成し遂げてしまうタイプの人とは、やや折り合いが悪いかもしれません。',
        'pdes5':'　それでも、このタイプの人は、全てのタイプの中で、最も社交的なため、現代社会の理想的なビジネスパーソンに最も近いタイプと言えるでしょう。',
        'authdes':'　菊池寛は、「真珠夫人」、「恩讐の彼方に」、「恩を返す話」、「忠直卿行状記」などで知られる、主に大正時代に活躍した作家です。作風の特徴は、人情味にあふれるものが多く、純文学というよりは、面白さを追求した通俗小説が大半を占めます。',
        'authdes2':'　作家としては、「真珠夫人」がベストセラーになり、一躍流行作家になりました。また、文藝春秋の創業者としての顔も持ち、今なお有名な、芥川賞、直木賞は菊池寛が創設しました。',
        'authdes3':'　そのため、他の文豪と異なり、実業家としての顔も持っており、今日でのビジネスパーソンとも言えるかもしれません。芥川龍之介とは親友であり、彼の死に際して、芥川賞を創設したことから、菊池寛の友情に厚い人柄が垣間見れます。',
        'authdes4':'　なお、菊池寛は、酒が飲めない体質だったため、もっぱらタバコを好み、お風呂にはめったにはいらなかった無精者だったとのことです。',
    }
    return render(request, 'web/kikuti.html',params)

def kazii(request):
    params = {
        'description':'梶井基次郎タイプは、研ぎ澄まされた感覚で、世界を解剖し、物事のあらゆる側面を表現することができる人です。',
        'citedes':'彼らは知らない。病院の窓の人びとは、崖下の窓を。崖下の窓の人びとは、病院の窓を。そして崖の上にこんな感情のあることを――',
        'citeauth':'梶井基次郎「ある崖下の感情」',
        'feature':'梶井基次郎タイプの特徴',
        'whatauth':'梶井基次郎はどんな人？',
        'pdes':'　このタイプの人は、非常に繊細でありながら、周囲には豪胆に振る舞い、弱みを見せないことから、他者評価と自己評価に違いを生みやすい人と言えるでしょう。',
        'pdes2':'　自身では、その鋭敏な感覚と、感情の機微を見分ける繊細さが当たり前のため、繊細タイプと思う一方、他者は、その豪胆さから、頼もしさを感じ、頼れる番長のように感じていることもあるでしょ。そのため、他者に自分を理解してもらうのに苦しむことが多いタイプと言えるでしょう。',
        'pdes3':'　しかし、面倒見がよく、兄貴的な性質を持っているのは、演技でもないため、このタイプの人は、繊細な感覚と、周囲の兄貴的気質の両方を併せ持っています。その点、他の繊細タイプとやや異なるでしょう。',
        'pdes4':'　また、派手さはあまりないため、その時代のスター選手にはなれないかもしれませんが、実力は確かなので、理解してもらえる人には理解してもらえることでしょう。そして、このタイプの人の感覚は鋭敏なので、誰が自分を理解し、誰が理解していないかも、即座にわかってしまうため、自分を理解してくれる人の少なさに苦しむこともあるかもしれません。',
        'pdes5':'　それでも、このタイプの人は、人との交際を苦手としていないので、基本的に、どのような仕事であってもうまくやっていけるでしょう。',
        'authdes':'　梶井基次郎は、「檸檬」、「Kの昇天」、「桜の木の下には」、「泥濘」などで知られる、大正末期、昭和初期に活躍した作家です。作風の特徴は、何気ない生活を、作者独特の鋭敏な感覚で描写した、清澄かつ底の深い心理描写にあり、他に類例がない、独自のスタイルを確立しています。',
        'authdes2':'　しかし作家として評価されたのは、主に死後であり、生前は結核に苦しみ、作品もほとんど評価されなかったことから、辛酸をなめました。',
        'authdes3':'　性格としては、兄貴肌で、面倒見がよく、病気に苦しみながら、放蕩するなど、このあたりは一般的な文豪らしい生活を送っていたと言えるでしょう。梶井基次郎の特徴は、やはりその尖すぎる繊細な感覚にあり、その描写の冴えは、文豪の中でもトップクラスと言えるでしょう。それでいて、静かな描写のため、好む人はとことん好む文章と言えるでしょう。',
        'authdes4':'　文豪の強みもそれぞれいろいろありますが、梶井基次郎の強みは、その独自の描写と繊細な感覚にあり、この点には関しては、他の文豪より一歩勝っていたと言っても過言ではないでしょう。',
    }
    return render(request, 'web/kazii.html',params)



def bizan(request):
    params = {
        'description':'川上眉山タイプは、全てのタイプの中で、二番目に出現しにくい性格パターンであり、このタイプの人は、最も悲劇的な人であり、文学作品の主人公たる煩悶青年に近い人です。',
        'citedes':'客はさる省の書記官に、奥村辰弥とて売出しの男、はからぬ病に公の暇を乞こい、ようやく本に復したる後の身を養わんとて、今日しもこの梅屋に来たれるなり。',
        'citeauth':'川上眉山「書記官」',
        'feature':'川上眉山タイプの特徴',
        'whatauth':'川上眉山はどんな人？',
        'pdes':'　このタイプの人の悲劇は、自分の望まない分野の才能に恵まれ、自分の大好きな分野の才能に恵まれなかった点にあることが多いです。例えば、文章が好きでも、文章の才能に充分に恵まれなかった一方、誰もが羨む美貌に恵まれたりといった風に。',
        'pdes2':'　そして、さらなる悲劇は、自分の大好きな分野においても、一般人よりは才能に恵まれているため、夢を諦めることもできず、かといって、その分野の天才に勝つこともできずと言ったふうに、板挟みに苦しむことでしょう。',
        'pdes3':'　また、このタイプの人は、繊細でもあるため、人生に絶望した場合、究極的な手段を取ることもあり、何かと危うさを抱えています。と、ここまで散々な言いようですが、このタイプの人の最大の強みは、自分自身の境遇にあります。このような境遇は、人々の共感を呼びやすく、うまく利用すれば、スター選手になることもできるでしょう。',
        'pdes4':'　そして、無冠の天才とあるように、基本的に全てのスペックは高く、磨けば、どの分野でも戦っていける素質を持っているため、一つの道を究めるスペシャリストよりも、複数の分野に精通しているジェネラリストに最も向いている人です。',
        'pdes5':'　ただやや打たれ弱いので、支えてくれる友人やパートナーの存在は不可欠といえるでしょう。',
        'authdes':'　川上眉山は、「書記官」、「大盃」、「観音岩」などで一部の人に知られる日本の作家です。知名度は低く、また作品を読む手段も決して豊富ではないため、今日では過去の作家と扱われることも多いです。',
        'authdes2':'　文学的には、尾崎紅葉の硯友社系に属しており、いくつかの作品は、高い評価を得ましたが、文壇に多大な影響を与えるまでとはいかず、最期は文学的ないきづまりで、自殺を選択したと言われています。そのため、文豪の中でも、悲劇的な一生を送った人と知られています。',
        'authdes3':'　川上眉山は、美貌に優れていたといえ、一時は樋口一葉との恋仲も噂されました。そのため、男の佳人薄命と、評するにふさわしい人でしょう。',
        'authdes4':'　他の文豪に比べ、現代でも盛んに議論されている作家ではありませんが、その悲劇的な一生と、文学的な煩悶や行き詰まりは、一部の人の共感を呼んでいる作家です。',
    }
    return render(request, 'web/bizan.html',params)

def kouyou(request):
    params = {
        'description':'尾崎紅葉タイプは、親分肌で、面倒見がよく、部下の信頼が厚い、人情味あふれる人です。',
        'citedes':'「宮、おのれ、おのれ姦婦、やい！貴様のな、心変をしたばかりに間貫一の男一匹はな、失望の極発狂して、大事の一生を誤つて了ふのだ。学問も何ももう廃めだ。この恨の為に貫一は生きながら悪魔になつて、貴様のやうな畜生の肉を啖らつて遣る覚悟だ',
        'citeauth':'尾崎紅葉「金色夜叉」',
        'feature':'尾崎紅葉タイプの特徴',
        'whatauth':'尾崎紅葉はどんな人？',
        'pdes':'　このタイプの人は、親分肌で面倒見がよく、部下の信頼が厚い上、行動力もあるため、経営者や、組織の上司に向いている人です。カリスマ性もあるため、このタイプの人を慕って、その組織に入るという人も多いことでしょう。',
        'pdes2':'　一方、このタイプの人は、口が悪いことが多いため、繊細な人からは、そこまで慕われない可能性があります。それでも、本質的には非常に優しい人ですので、その優しさを見抜いた人は、表面的に口が悪くても、あなたを慕うことでしょう。',
        'pdes3':'　親分肌のため、基本的に一人で何かをすることは少なく、いつも誰かに囲まれていることが多いでしょう。部下もたくさんほしいと感じている人がほとんどだと思います。',
        'pdes4':'　そんな親分肌な紅葉タイプの人ですが、常識にうるさく、部下の不祥事や、非常識な言動には我慢ならないこともあり、ときに厳しすぎる仕打ちをしてしまうこともあるかもしれません。',
        'pdes5':'　そのため、単に常識を押し付けるのではなく、部下の性格や境遇を思いやって、アドバイスすると、よりよい親分になれることでしょう。',
        'authdes':'　尾崎紅葉は、「金色夜叉」、「三人妻」、「多情多恨」、「二人比丘尼色懺悔」などで知られる明治時代に活躍した作家です。文体は当時における文語文を駆使し、流麗かつ美しい文章は、人気を呼び、当時の大人気作家として君臨していました。',
        'authdes2':'　特に代表作「金色夜叉」は、大ヒットし、当時は読んでいない人がいないレベルで、流行し、明治文学の代表的な作家の一人です。しかし、作風は通俗小説であったため、純文学嗜好の人は、あまり好まず、あくまで流行作家として人気を博すにとどまり、後世の文学への影響は人気の割には小さかったと言えるでしょう。',
        'authdes3':'　このような事情は、同じく通俗小説を手がけた菊池寛の「真珠夫人」にも書かれており、当時の知識人の中には、「金色夜叉」を大衆的として、軽んじる人も少なくなかったようです。しかし、そうは言ってもストーリーは非常に面白く、飽きさせない展開になっているので、万人におすすめしたい作品でもあります。',
        'authdes4':'　今日では、そこまで広く読まれている作家とは言えないかも知れませんが、読者を楽しませた作家として、一度読んでみるのもいいかもしれませんね。',
    }
    return render(request, 'web/kouyou.html',params)

def ranpo(request):
    params = {
        'description':'江戸川乱歩タイプは、自分だけの世界を持っており、思索や空想にふけりがちな、ミステリアスな方です。',
        'citedes':'奥様の方では、少しも御存じのない男から、突然、このような無躾な御手紙を、差上げます罪を、幾重にもお許し下さいませ。こんなことを申上げますと、奥様は、さぞかしびっくりなさる事で御座いましょうが、私は今、あなたの前に、私の犯して来ました、世にも不思議な罪悪を、告白しようとしているのでございます。',
        'citeauth':'江戸川乱歩「人間椅子」',
        'feature':'江戸川乱歩タイプの特徴',
        'whatauth':'江戸川乱歩はどんな人？',
        'pdes':'　このタイプの人は、幼少期から空想にふけることが多く、夢見がちな性格であることが多いです。そのため、人付き合いがあまり得意ではなく、周囲の人とどう接したらいいのか分からず、悩むことも多いかもしれません。',
        'pdes2':'　一方、想像力は大変豊かであるため、芸術関係の仕事であったり、クリエイティブな仕事への適正は高く、独自の世界観を構築することができるでしょう。',
        'pdes3':'　時として、人間嫌いであることも多い、このタイプの人ですが、多くの場合、周囲との接し方や、何を話したらいいのか分からず戸惑っているだけであり、心の底から人間嫌いであるわけではありません。そのため、そうした打ち解け方を一度マスターすれば、びっくりするくらい別人のように社交的になることでしょう。',
        'pdes4':'　しかし、このタイプの人は、見切りをつけるのも早く、仕事を簡単に辞めてしまったり、住む場所をころころ変えたりと、周囲から逃げるようにして、転々とする癖があります。',
        'pdes5':'　そのため、できるなら、早くにパートナーを見つけ、安定した生活に入るようにするといいでしょう。',
        'authdes':'　江戸川乱歩は、「芋虫」、「パノラマ島奇譚」、「陰獣」、「D坂の殺人事件」などで知られる大正から昭和時代に活躍した作家です。文章は非常に読みやすく、題材も世にも奇妙なものをテーマにしていることが多く、読者を飽きさせません。そのため、江戸川乱歩は現在でも読まれている、人気作家の一人です。',
        'authdes2':'　探偵小説を主とする一方、「人でなしの恋」、「人間椅子」のような、変態的な世界の描出も得意としているため、乱歩の作品は、シンプルに読んでいて面白く、文学に興味がなくてもおすすめできる作家です。',
        'authdes3':'　さて、そんな江戸川乱歩の性格は、人間嫌いの傾向があり、空想や思索にふけることが多い人でした。また、仕事も作家以外で、様々なものを転々としており、引っ越しも数多くしていることから、放浪の癖がありました。そのため、他の文豪とはまたちょっと毛色の違う変わり者だったと言えそうです。',
        'authdes4':'　ただ、そんな人間嫌いな江戸川乱歩ですが、意外にも長生きしており、悲惨な一生を送る文豪も少なくない中では、割りかし、穏当な一生だったと言えるのかもしれませんね。',
    }
    return render(request, 'web/ranpo.html',params)


def zenzou(request):
    params = {
        'description':'葛西善蔵タイプは、実験的な人で、自身の興味のために、自身の生活までも犠牲にして、徹底的に自身の仕事を探究する人です。',
        'citedes':'ぽつねんと机の前に坐り、あれやこれやと考へて、思ひのふさぐ時、自分を慰めてくれ、思ひを引立ててくれるものは、ザラな顔見知合ひの人間よりか、窓の外の樹木――殊にこのごろの椎の木の日を浴び、光りに戯れてゐるやうな若葉ほど、自分の胸に安らかさと力を与へてくれるものはない',
        'citeauth':'葛西善蔵「椎の若葉」',
        'feature':'葛西善蔵タイプの特徴',
        'whatauth':'葛西善蔵はどんな人？',
        'pdes':'　このタイプの人は、好奇心が強く、何事も実験と捉える傾向があります。そのため、「もし自分の生活を悲惨にしたらどうなるのだろう」と疑問にしたら、実際に自分の生活を悲惨にしてどうなるか試してしまうような人です。',
        'pdes2':'　そして、自分の生活をあまりに軽視しすぎているため、周囲の人からすると、信じられない無茶をすることもあります。それも、このタイプの人は、自分の生活を実験台にしてでも、自身の興味を追おうとするため、配偶者は大変な苦労をするでしょう。',
        'pdes3':'　そのため、このタイプの人が平穏に生活するには、あえて、好奇心をそそらせない仕事に就くのがいいかもしれません。その点、ルーティンワークの仕事が合っているかもしれません。',
        'pdes4':'　しかし、そうは言っても、このタイプの人は生活を軽視しているため、まじめに働き続けるのを苦手としており、いつ辞めてしまうかもわからないため、それならばいっそ、芸術の道を選択するのもありかもしれません。',
        'pdes5':'　なお、このタイプは、三番目に出現しにくい性格パターンです。',
        'authdes':'　葛西善蔵は、「子をつれて」、「哀しき父」、「贋物」、「不能者」などで知られる主に大正時代に活躍した作家です。作品のほとんど全てが、「私小説」であり、私小説の神様とまで評され、文壇に大きな影響を与えました。',
        'authdes2':'　作品のテーマは、自身の生活をそのまま描出していることから、酒、悲惨な生活の中での親子関係などを描写しています。特に、葛西善蔵は、アル中の中のアル中といえるほど、酒を常に飲んでいたため、芥川龍之介や太宰治のような教養に裏付けされた作品を書くことができず、それもあってか、自身の生活を書き続けた作家です。',
        'authdes3':'　そのため、小説にあるとおり、家庭は悲惨そのものであり、葛西善蔵は、クソ親父としか言いようがない人でした。しかし、自身の生活を題材にした葛西善蔵の作品は、他の文豪にはない生活の喘ぎと、飾り気のない声が描写されているため、「私小説」文学として、超一流の作家でもありました。',
        'authdes4':'　そして、葛西善蔵自身、作品のために、どんどん生活を悲惨にしていかざるを得ない側面もあったため、その点、体を張って文学をやり続けた作家とも言えます。',
    }
    return render(request, 'web/zenzou.html',params)